_posts/2010-10-24-blog-workflow.html
---
layout: post
title: My Blogging Work-flow
categories:
- org-mode
- emacs
- blogging
- elisp
---

<p>
I've been blogging for less than a week. So far, I have the workings of a simple work-flow for blogging. Below, I've documented the basics.
</p>

<div id="outline-container-1" class="outline-4">
<h4 id="sec-1">Settings </h4>
<div class="outline-text-4" id="text-1">

<p>The directories of the blog.
</p>


<pre class="src src-elisp"><span class="linenr">1:  </span>(setq
<span class="linenr">2:  </span> blog-directory <span style="color: #ad7fa8; font-style: italic;">"~/Dropbox/blog/"</span>
<span class="linenr">3:  </span> blog-posts-directory (concat blog-directory <span style="color: #ad7fa8; font-style: italic;">"_posts/"</span>)
<span class="linenr">4:  </span> blog-base-directory (concat blog-directory <span style="color: #ad7fa8; font-style: italic;">"org/posts/"</span>)
<span class="linenr">5:  </span> blog-draft-directory (concat blog-directory <span style="color: #ad7fa8; font-style: italic;">"draft/"</span>))
</pre>



</div>

</div>

<div id="outline-container-2" class="outline-4">
<h4 id="sec-2">Publishing </h4>
<div class="outline-text-4" id="text-2">

<p>This allows me publish my entire blog with <code>C-c C-e X blog</code>. It exports any changed files from the <code>blog-base-directory</code> into <code>blog-posts-directory</code>. It should be unnecessary to change any of the below, as long as you modify your settings properly.
</p>


<pre class="src src-elisp"><span class="linenr"> 1:  </span>(setq org-publish-project-alist
<span class="linenr"> 2:  </span>      `(
<span class="linenr"> 3:  </span>        (<span style="color: #ad7fa8; font-style: italic;">"blog"</span>
<span class="linenr"> 4:  </span>         <span style="color: #888a85;">;; </span><span style="color: #888a85;">Path to your org files.
<span class="linenr"> 5:  </span></span>         <span style="color: #729fcf;">:base-directory</span> ,blog-base-directory
<span class="linenr"> 6:  </span>         <span style="color: #729fcf;">:base-extension</span> <span style="color: #ad7fa8; font-style: italic;">"org"</span>
<span class="linenr"> 7:  </span>
<span class="linenr"> 8:  </span>         <span style="color: #888a85;">;; </span><span style="color: #888a85;">Path to your Jekyll project.
<span class="linenr"> 9:  </span></span>         <span style="color: #729fcf;">:publishing-directory</span> ,blog-posts-directory
<span class="linenr">10:  </span>         <span style="color: #729fcf;">:recursive</span> t
<span class="linenr">11:  </span>         <span style="color: #729fcf;">:publishing-function</span> org-publish-org-to-html
<span class="linenr">12:  </span>         <span style="color: #729fcf;">:headline-levels</span> 4 
<span class="linenr">13:  </span>         <span style="color: #729fcf;">:html-extension</span> <span style="color: #ad7fa8; font-style: italic;">"html"</span>
<span class="linenr">14:  </span>         <span style="color: #729fcf;">:body-only</span> t <span style="color: #888a85;">;; </span><span style="color: #888a85;">Only export section between &lt;body&gt; &lt;/body&gt;
<span class="linenr">15:  </span></span>    )))
</pre>



</div>

</div>

<div id="outline-container-3" class="outline-4">
<h4 id="sec-3">Blog-publish </h4>
<div class="outline-text-4" id="text-3">

<p><code>C-c C-e X blog</code> is nice, but it involves being in org mode and does strain the pinky a little. However, <code>M-x blog-publish</code> would be more convenient, and able to be run from any buffer.
</p>


<pre class="src src-elisp"><span class="linenr">1:  </span>(<span style="color: #729fcf; font-weight: bold;">defun</span> <span style="color: #edd400; font-weight: bold;">blog-publish</span> ()
<span class="linenr">2:  </span>  (interactive)
<span class="linenr">3:  </span>  (org-publish-project <span style="color: #ad7fa8; font-style: italic;">"blog"</span>))
</pre>



</div>

</div>

<div id="outline-container-4" class="outline-4">
<h4 id="sec-4">Blog-draft </h4>
<div class="outline-text-4" id="text-4">

<p>Next, I want to be able to draft a post easily without publishing it, just as a preliminary draft. The following function allows me to easily do this with <code>M-x blog-draft some-filename</code>.
</p>


<pre class="src src-elisp"><span class="linenr">1:  </span>(<span style="color: #729fcf; font-weight: bold;">defun</span> <span style="color: #edd400; font-weight: bold;">blog-draft</span> ()
<span class="linenr">2:  </span>  (interactive)
<span class="linenr">3:  </span>  (<span style="color: #729fcf; font-weight: bold;">let*</span> ((result (read-from-minibuffer <span style="color: #ad7fa8; font-style: italic;">"File: "</span> nil ))
<span class="linenr">4:  </span>         (buffer (generate-new-buffer (concat blog-draft-directory result <span style="color: #ad7fa8; font-style: italic;">".org"</span>))))
<span class="linenr">5:  </span>    (set-buffer buffer)
<span class="linenr">6:  </span>    (set-visited-file-name (buffer-name buffer))
<span class="linenr">7:  </span>    (switch-to-buffer buffer)))
</pre>



</div>

</div>

<div id="outline-container-5" class="outline-4">
<h4 id="sec-5">Blog-post </h4>
<div class="outline-text-4" id="text-5">

<p>I would also like to be able to effortlessly post a draft when I am ready without having to remember jekyll's naming convention. <code>M-x blog-post</code> will do that.
</p>


<pre class="src src-elisp"><span class="linenr"> 1:  </span>(<span style="color: #729fcf; font-weight: bold;">defun</span> <span style="color: #edd400; font-weight: bold;">blog-post</span> ()
<span class="linenr"> 2:  </span>  (interactive)
<span class="linenr"> 3:  </span>  (save-buffer)
<span class="linenr"> 4:  </span>  (<span style="color: #729fcf; font-weight: bold;">let*</span> ((date (calendar-current-date))
<span class="linenr"> 5:  </span>         (filebase (car (last (split-string
<span class="linenr"> 6:  </span>                     (buffer-file-name (current-buffer)) <span style="color: #ad7fa8; font-style: italic;">"/"</span>))))
<span class="linenr"> 7:  </span>         (filename (format <span style="color: #ad7fa8; font-style: italic;">"%s-%s-%s-%s"</span> (caddr date) (car date)
<span class="linenr"> 8:  </span>                       (cadr date) filebase))
<span class="linenr"> 9:  </span>         (filepath (concat blog-base-directory filename)))
<span class="linenr">10:  </span>    (message filepath)
<span class="linenr">11:  </span>    (shell-command (format <span style="color: #ad7fa8; font-style: italic;">"mv %s %s"</span>
<span class="linenr">12:  </span>                           (buffer-file-name (current-buffer))
<span class="linenr">13:  </span>                           filepath))
<span class="linenr">14:  </span>    (set-visited-file-name (buffer-name (current-buffer)))
<span class="linenr">15:  </span>    (blog-publish)))
</pre>



</div>

</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">Conclusion </h3>
<div class="outline-text-3" id="text-1">

<p>Using these commands, I can easily maintain my blog with emacs, draft posts and publish them. After I've played around with my work-flow a bit more, I'll try to make it into an easy download. 
</p>
<p>
<b>Any suggestions?</b>
</p></div>
</div>
